content/posts/the_cowpox_of_doubt.md
+++
title = "The Cowpox of Doubt"
author = ["Daniel Biasiotto"]
date = 2022-12-07T02:07:00+01:00
tags = ["article"]
draft = false
+++

-   Source: <https://slatestarcodex.com/2014/04/15/the-cowpox-of-doubt/>
-   Author: [Slate Star Codex]({{< relref "20210609140910-slate_star_codex.md" >}})
-   Related: [Rationality]({{< relref "rationality.md" >}})


## Notes {#notes}

> And I worry that we are vaccinating people against reading the research for themselves instead of trusting smarmy bloggers who talk about how stupid the other side is.
>
> That we are vaccinating people against thinking there might be important truths on both sides of an issue.
>
> That we are vaccinating people against understanding how “scientific evidence” is a really complicated concept, and that many things that are in peer-reviewed journals will later turn out to be wrong.
>
> That we are vaccinating people against the idea that many theories they find absurd or repugnant at first will later turn out to be true, because nature doesn’t respect our feelings.
>
> That we are vaccinating people against doubt.
>
> And maybe this is partly good. It’s probably a good idea to trust your doctor and also a good idea to trust your climatologist, and rare is the field where I would feel comfortable challenging expert consensus completely.

-   too much talk of easily debunkable stuff can be counter-productive
    -   you might start to believe all falsehood is easily recognisable
-   evidence is complicated
